{
  "date": "2024-09-28 02:02:58",
  "text": "We were asked to give an honest review of our new deck that was recently finished by Deck Masters. OK!\nFirst and foremost, we are so happy with our new deck and how it turned out.  As a homeowner you always wonder how a big project like this will turn out when you're in the long planning/waiting phase.  These guys nailed it, truly.  The railing system we had installed is truly stunning! Shoutout to Sean who was especially awesome and showed a very professional demeanor, he even asked to come work on the weekend to help finish our deck railing on time(Thank you!).  We had a deck board that we found had been damaged, and a piece of trim we wanted fixed.  They made it known that it would be quickly/happily fixed which they did! Deck 5 out of 5 stars.\nWe were originally told our project would start late July with the possibility of it starting sooner when we put our deposit down in May.  We had not heard anything last week of July so I reached out and was told they were running behind and it wouldn't be til late august.  We were frustrated and decided to cancel the project because we figured it was to late in the summer that we wouldn't be able to enjoy it.  I quickly received a call from the owner Jordan who was apologetic and assured me our project was next and would start in a few days.  He mentioned that our project would take about a week to a week and a half.  We decided to continue with the project.  They did start the project just a few days later.\nOur deck took nearly six weeks from start to finish.  There was spans of several days and even well over a week where we wouldn't hear from or see anyone during this time.  Prompting us to reach out and get an update several times.  We were usually told that they were waiting on supplies or needed to order something else.  We started to feel like the planning was either last minute for the orders or they just had bitten off more than they could chew with projects this year.\nOur advice?  Most customers realize how much things can change with deadlines, material, etc.  It's easier for us to be flexible if you keep us in the loop, even with the smallest details.\nThanks again for our wonderful new deck.  Would definitely use Deck Masters again.\n\n*EDIT*\nWas called personally by the owner, Jordan shortly after this review.  It's obvious how important customer satisfaction is to him.  We had a nice conversation and he took full credit for the delays during our project, even though some of the items were out of his control (Spenard Builders Supply closing one of their locations this summer creating serious issues with product availability) and he made NO excuses.  Thanks for driving out to our home, and thank you for the nice mug!",
  "author": "Matthew Freckleton",
  "rating": 5,
  "source": "Google",
  "avatarUrl": "https://images.stokeleads.com/T9vzDPLuSiZ3WAJQEOXC-1733889552"
}