{
  "date": "2025-09-13 04:23:30",
  "text": "We recently completed a very large, complex project with Deckmasters. Like any project of this size, there were challenges along the way, but I can confidently say we are incredibly satisfied with the end result and would highly recommend them.\n\nOur original scope was already ambitious: replacing our second-story wraparound deck, replacing the deck over our garage, and adding a brand-new first-floor deck with stairs connecting the two levels. Partway through, we expanded the project to include replacing all the exterior siding of our home, which was long overdue for repairs. These improvements were critical for both the safety of our kids and the longevity of our home.\n\nNaturally, a project of this size came with its share of hurdles—delays with siding and materials, a septic system replacement (which we handled separately), and, most significantly, discovering major water damage and black mold in the garage walls once the old deck was removed. Deckmasters stepped up in a huge way. They reconstructed the walls of our garage (remarkably without removing the interior drywall or garage doors) saving us significant time and cost. They also rebuilt the garage roof and ensured everything was structurally sound for the long term.\n\nWhat stood out most was their attention to detail and the work ethic of their crew. Absolutely 10/10. They were respectful, hardworking, and clearly cared about the quality of their work. Communication wasn’t perfect at every stage, but whenever we raised concerns, the team responded with ownership and genuine effort to resolve the issue. To improve things, they even set up weekly in-person check-ins with us, which went a long way in my book. Their commitment to doing the best job possible was evident throughout this entire experience.\n\nWe’d like to give a special shoutout to Sean, who not only treated our home as if it were his own but also personally repaired the serious issues with our garage roof and walls like a real-life magician. On top of that, he quickly became a favorite of our dogs, delivering daily attention and treats. :) It may seem like a simple thing, but our dogs are part of our family and we noticed his care for them. Jordan Webb handled some of the hardest points of the project with humility. After a roofer left us in the lurch with a sub-par job and an exposed roof in the rain, I had a full-blown anxiety attack. Jordan listened, let me vent and cry, apologized, and quickly brought in a new roofer who finished the job correctly. His integrity and the pride he takes in his work is clear, and his focus on details that affected the safety of our kids meant a lot to us.\n\nJustin deserves huge credit for meticulously replacing our siding, soffit, and fascia. Our house is an odd shape with tricky angles, but he measured and cut everything with precision so the new materials fit beautifully. He even adjusted deck boards on our back deck after I pointed out that a gap between the deck and the house wasn’t perfectly parallel (small details that made a big difference in the finished product). Robert, Quillin, and Cameron were wizards when it came to finishing touches—replacing scratched boards, repairing minor details we flagged and then some, and framing our lower deck with real craftsmanship.\n\nAbove all, every single member of this crew was kind and respectful. That goes a long way in my book. Big projects are never perfect, but Deckmasters proved themselves to be problem-solvers who care deeply about both their craft and their clients. We’re grateful for all their hard work and proud of the home we now have because of them.",
  "author": "Rachel Blakeslee",
  "rating": 5,
  "source": "Google",
  "avatarUrl": "https://images.stokeleads.com/UKIFVUI3UfHrZ1Ti5Af8-1757743671"
}